{
  "basics": {
    "name": "Luisa Rojas",
    "label": "Computer Science Student",
    "picture": "",
    "email": "luisa.rojas@acm.org",
    "phone": "",
    "website": "",
    "profiles": [
      {
        "network": "Github",
        "username": "lrojas12",
        "url": "lrojas12.github.io"
      }
    ]
  },
  "work": [
    {
      "company": "University of Ontario Institute of Technology",
      "position": "Teaching Assistant",
      "website": "https://science.uoit.ca/",
      "startDate": "2017-01-09",
      "endDate": "2017-04-25",
      "summary": "CSCI1061, Programming Workshops II, is a second intensive course on computer programming (C++) that continues from CSCI 1060U and covers more advanced theory and practice. The lectures introduce modern concepts in program design and construction for larger scale programs and the laboratories provide an opportunity to apply these concepts. Topics that are covered in this course include advanced program design, design patterns, program refactoring, templates and standard template libraries, data structures, debugging and version control.",
      "highlights": [
        "Prepare all 3-hour laboratory sections assigned.",
		"Deliver and present the students with the relevant content pertaining the current laboratory project.",
		"Provide availabiltiy for office hours and drop-in for questions or concerns from students."
      ]
    },
	{
      "company": "University of Ontario Institute of Technology",
      "position": "System Administrator",
      "website": "https://international.uoit.ca/international-office/",
      "startDate": "2014-09-01",
      "endDate": "2014-12-15",
      "summary": "The International office, within the Office of the Vice-President, Research, Innovation and International, provides overall co-ordination of internationalization at UOIT, including strategic planning, faculty engagement and policy development. Operationally, the International office provides support for student exchange, visiting scholars, faculty mobility, and international partnership and program development.<br><br>Job tasks include all listed below and the following:",
      "highlights": [
        "Administrator of health insurance for all international students (UHIP)",
		"Responsible for the production of events, from conception through completion."
      ]
    },
	{
      "company": "University of Ontario Institute of Technology",
      "position": "Assistant System Administrator",
      "website": "https://international.uoit.ca/international-office/",
      "startDate": "2014-05-01",
      "endDate": "2014-08-15",
      "summary": "The International Office.",
      "highlights": [
        "Elaboration of invitation letters for international visiting scholars interested in conducting research at the university.",
		"Design of posters and flyers for advertisement purposes utilizing various graphics software",
		"Creation and administration of forms for international visitors (scholars, delegations, partners), international, exchange, Science Without Borders students, among others.",
		"Control of the International webpages under the UOIT website.",
		"Contacting connections and setting up meetings."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Ontario Institute of Technology",
      "area": "BSc Computer Science (Honours)",
      "startDate": "2013-06",
      "endDate": "2017-04",
      "courses": [
        "CSCI3030 - Database Systems and Concepts",
		"CSCI4030 - Big Data Analytics",
		"CSCI4020 - Compilers",
		"CSCI3020 - Operating Systems",
		"CSCI2040 - Software Design and Analysis",
		"CSCI3070 - Design and Analysis of Algorithms",
		"CSCI3230 - Web Application Development",
		"CSCI4100 - Mobile Devices"
      ]
    }
  ],
  "awards": [
	{
      "title": "Vice-President of Marketing and Design",
      "date": "2016-09-01",
      "awarder": "UOIT Science Council",
      "summary": "<ul><li>Design of posters, flyers and banners to advertise upcoming events and meetings.</li><li>Creation, management and maintenance of the website.</li></ul>"
    },
    {
      "title": "Founding Chair",
      "date": "2016-05-25",
      "awarder": "UOIT ACM-W Student Chapter",
      "summary": "Principal officer; responsible for leading the Chapter and managing its activities in accordance with the mission of ACM-W, the policies and procedures of the ACM. Presides at all meetings of the Chapter and prepares the Chapter’s final report each year."
    },
	{
      "title": "Secretary",
      "date": "2015-09-01",
      "awarder": "ASME UOIT Chapter",
      "summary": "Job tasks include all below and the following: <ul><li>Manage all general and executive meetings logistics, attend and record minutes.</li><li>Direct activities related to annual events on and off campus.</li><li>Maintain club documents and records.</li></ul>"
    },
	{
      "title": "Webmaster and Social Media Director",
      "date": "2014-09-01",
      "awarder": "ASME UOIT Chapter",
      "summary": "<ul><li>Create and manage the club website.</li><li>Assist on the planning and elaboration of events and advertisement of the club.</li><li>Contact club members and coordinate meetings.</li></ul>"
    }
  ],
  "publications": [
    {
      "name": "dynOBD",
      "releaseDate": "2016-12-15",
      "summary": "Android application to keep track of statistics about any given car trip. It uses Bluetooth to connect to an OBDII (On-Board Diagnostics) device that is connected by the user to the car's DLC (Data Link Connector). It also provides a live data feed showing the current speed and throttle of the car."
    },
	{
      "name": "Graphizzer",
      "releaseDate": "2016-12-15",
      "website": "https://graphvizzer.objectivetruth.ca",
      "summary": "Web-based application that, using the popular DOT notation, generates an accurate visualization by retrieving its image using the imgur API."
    },
	{
      "name": "CPU Capacity Comparisson",
      "releaseDate": "2015-04-15",
      "summary": "Determined the optimal amount of threads for specific mathematical calculations in relation to the number of iterations, magnitude of estimation error and CPU capacity."
    },
	{
      "name": "Simulated Banking System",
      "releaseDate": "2016-04-15",
      "summary": "Designed and implemented a Banking System in the form of a console application, following various software quality control aspects in the context of the Extreme Programming Process Model. The project uses a C++ automated teller machine terminal for simple banking transactions, while a Java batch processor maintains and updates the master account file in the back end."
    },
	{
      "name": "A-Priori and PCY Implementations",
      "releaseDate": "2016-04-15",
      "summary": "Conducted market-basket analysis by developing various efficient frequent itemsets algorithms on retail datasets. The algorithms were analysed and then compared in relation to their corresponding run times."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
		"JQuery",
		"NodeJS"
      ]
    },
    {
      "name": "Database Management",
      "level": "Master",
      "keywords": [
        "SQL",
        "NoSQL"
      ]
    },
    {
      "name": "Mobile Development",
      "level": "Intermediate",
      "keywords": [
        "Android - Java",
        "Swift"
      ]
    },
	{
      "name": "Other",
      "level": "Master",
      "keywords": [
        "C",
        "C#",
		"C++",
		"Python",
		"Java"
      ]
    },
	{
      "level": "Beginner",
      "keywords": [
        "Clojure",
        "Scala"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
	{
      "language": "Spanish",
      "fluency": "Native speaker"
    },
	{
      "language": "French",
      "fluency": "Intermediate"
    }
  ]
}
